[
  {
    "title": "Q&A chat Bot",
    "imageSrc": "projects/chatbot.webp",
    "description": "Designed and implemented a web-based security chatbot that answers network security questions while maintaining complete data privacy through local processing and intelligent document retrieval systems.",
    "skills": [
      "HTML/CSS/JS",
      "Python",
      "Flask",
      "HuggingFace",
      "ChromaDB",
      "NLP"
    ]
  },
  {
    "title": "Blood Donation Management",
    "imageSrc": "projects/BBMS.jpeg",
    "description": "Developed a full-stack app using React.js, PHP, and MySQL to manage and secure donor registration, blood inventory with authentication and role-based access. Enhanced database performance by 40% through indexing and load testing with over 10,000 simulated records.",
    "skills": [
      "ReactJs",
      "PHP",
      "MySQL",
      "HTML/CSS",
      "Javascript",
      "RESTful API Integration"

    ]
  },
  {
    "title": "Online Banking System",
    "imageSrc": "projects/banking.jpg",
    "description": "This application is designed to streamline online banking operations, providing a platform for users to securely manage transactions, payments, and account details, while enabling admins to oversee customer activities and services.",
    "skills": ["React", "Javascript", "PHP", "MySQL", "HTML/CSS"]
  },
  {
    "title": "Spotting Forge News Using ML Techniques",
    "imageSrc": "projects/MLProject.jpeg",
    "description": "Developed and evaluated multiple machine learning classifiers for text classification, implementing advanced preprocessing, feature extraction, and model tuning. Achieved 97.2% accuracy using Decision Tree, outperforming other models through effective pipeline optimization and cross-validation.",
    "skills": ["Naïve Bayes", "Logistic Regression", "Decision Tree", "Random Forest", "Support Vector Machine (SVM)"]
    
  },
  {
    "title": "Airline Reservation System",
    "imageSrc": "projects/airline.png",
    "description": "Designed a responsive airline reservation website using HTML, CSS, and JavaScript, featuring interactive pages for flight details, booking, payments, and user authentication. Implemented structured navigation across multiple components including reservation forms and company information. Focused on enhancing user experience through clean UI design and intuitive layout.",
    "skills": ["HTML","CSS","Javascript","DOM Manipulation","Form Handling"]
    
  }
]
